// cs01.cpp : 此文件包含 "main" 函数。程序执行将在此处开始并结束。
//
#include <stdio.h>
#include <iostream>
#include <stdlib.h>
#include <time.h>

//M：65635365625235325265635365615135315125235325215135315165635365625235325265635365605035305025235325205035305015135315125235325215135315105035305025235325205035305065635356252353252656353656151353151252353252151353151656353656252353252656353454
//G：254355153256235251056355461151336154151034156110550150052030256256132252350325112052333054055231255051336154150665264150266506012264453605631520256431054354632404350334153250253251352352045150130156213436252353223135051260513356201524514343432
char matrix[10][10];
void initMatrix()
{
    srand(int(time(0)));
    for (int i = 0;i < 10;i++)
    {
        for (int j = 0;j < 10;j++)
        {
            int val = rand();
            if (val % 2 == 0)
            {
                matrix[i][j] = 1;
            }
            else
            {
                matrix[i][j] = 0;
            }
        }
    }
}
void printMatrix()
{
    printf("\n\r Matrix table \n\r");
    for (int i = 0;i < 10;i++)
    {
        for (int j = 0;j < 10;j++)
        {
            printf("%d\t", matrix[i][j]);
        }
        printf("\n\r");
    }
}
int move(int dir)
{
    //0=向北移动，1=向南移动，2=向东移动，3=向西移动，4=不动，5=捡拾罐子，6=随机移动
    if (dir > 6 || dir < 0)
        return 0;

        return 1;
}
int main()
{
    std::cout << "Hello World!\n";
    initMatrix();
    printMatrix();
}

// 运行程序: Ctrl + F5 或调试 >“开始执行(不调试)”菜单
// 调试程序: F5 或调试 >“开始调试”菜单

// 入门使用技巧: 
//   1. 使用解决方案资源管理器窗口添加/管理文件
//   2. 使用团队资源管理器窗口连接到源代码管理
//   3. 使用输出窗口查看生成输出和其他消息
//   4. 使用错误列表窗口查看错误
//   5. 转到“项目”>“添加新项”以创建新的代码文件，或转到“项目”>“添加现有项”以将现有代码文件添加到项目
//   6. 将来，若要再次打开此项目，请转到“文件”>“打开”>“项目”并选择 .sln 文件
